Revit 2026 API

# TableSectionDataInsertRow Method

---

Inserts a row data at a specified index.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void InsertRow(
	int nIndex
)
```
```vb
Public Sub InsertRow (
	nIndex As Integer
)
```
```cpp
public:
void InsertRow(
	int nIndex
)
```
```fsharp
member InsertRow :
        nIndex : int -> unit
```

#### Parameters

nIndex Int32
     An integer index.

| Exception | Condition |
| --- | --- |
| ArgumentException | The row can't be inserted in data section of standard schedule except Key Schedule, Sheet List Schedule or following categories without emdeded schedule: MEP Space, Room, Area. or nIndex is invalid index. |

#### Reference

TableSectionData Class

Autodesk.Revit.DB Namespace